In [81]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [118]:
df= pd.read_csv('Credit card transactions - Project - 2.csv')
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India  05-May-15       Gold    Bills      F  171574

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

In [84]:
df.describe()

              index         Amount
count  26052.000000   26052.000000
mean   13025.500000  156411.537425
std     7520.708943  103063.254287
min        0.000000    1005.000000
25%     6512.750000   77120.250000
50%    13025.500000  153106.500000
75%    19538.250000  228050.000000
max    26051.000000  998077.000000

In [5]:
df.isnull().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

In [120]:
df['Date']=pd.to_datetime(df['Date'],format='%d-%b-%y')
df['Date'].dtype

dtype('<M8[ns]')

In [93]:
df['City']=df['City'].astype('string')
df['Card Type']=df['Card Type'].astype('string')
df['Exp Type']=df['Exp Type'].astype('string')
df['Gender']=df['Gender'].astype('string')

In [7]:
df['Date'].head(2)

0   2014-10-29
1   2014-08-22
Name: Date, dtype: datetime64[ns]

In [8]:
num=df['City'].nunique()
print(num)

986

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  string
 2   Date       26052 non-null  datetime64[ns]
 3   Card Type  26052 non-null  string
 4   Exp Type   26052 non-null  string
 5   Gender     26052 non-null  string
 6   Amount     26052 non-null  int64
dtypes: datetime64[ns](1), int64(2), string(4)
memory usage: 1.4 MB

#### Question 1
 Write a query to print top 5 cities with highest spends and their percentage contribution of total credit card spends

In [ ]:
top_cities= df.groupby('City')['Amount'].sum()
top_cities.sort_values(ascending=False).reset_index()
top_cities.head().reset_index()

               City   Amount
0   Achalpur, India  1606641
1   Adilabad, India  1769464
2  Adityapur, India   963993
3      Adoni, India  1575355
4      Adoor, India   647725

In [11]:
## percentage
total_amount=df['Amount'].sum()
print(total_amount)

4074833373

In [75]:
percentage= (top_cities/total_amount)%100
print(percentage)

City
Achalpur, India     0.000394
Adilabad, India     0.000434
Adityapur, India    0.000237
Adoni, India        0.000387
Adoor, India        0.000159
                      ...
Zaidpur, India      0.000178
Zamania, India      0.000212
Zira, India         0.000403
Zirakpur, India     0.000135
Zunheboto, India    0.000114
Name: Amount, Length: 986, dtype: float64

In [87]:
top5_cities= pd.DataFrame({
    'amount': top_cities ,'percentage_of_total':percentage
}).reset_index()
answer_1=top5_cities.head()
print(answer_1)

               City   amount  percentage_of_total
0   Achalpur, India  1606641             0.000394
1   Adilabad, India  1769464             0.000434
2  Adityapur, India   963993             0.000237
3      Adoni, India  1575355             0.000387
4      Adoor, India   647725             0.000159

#### Question 2
 Write a query to print highest spend month and amount spent in that month for each card type.

In [88]:
df['Y-M']=df['Date'].dt.to_period('M')

monthly_spend= df.groupby(['Y-M','Card Type'])['Amount'].sum().reset_index()
monthly_spend.head(5)

       Y-M  Card Type    Amount
0  2013-10       Gold  48207082
1  2013-10   Platinum  50634540
2  2013-10  Signature  57196872
3  2013-10     Silver  51321598
4  2013-11       Gold  48555781

In [18]:
highest_month=monthly_spend.sort_values(['Card Type','Amount'],ascending=False)
card_Spend=highest_month.groupby('Card Type').first().reset_index()
card_Spend.head()

   Card Type      Y-M    Amount
0       Gold  2015-01  55455064
1   Platinum  2014-08  57936507
2  Signature  2013-12  58799522
3     Silver  2015-03  59723549

#### Question_3

In [96]:
df_sorted_value=df.sort_values(by=['Card Type','Date'])
df_sorted_value['Cumulative_spend']=df_sorted_value.groupby('Card Type')['Amount'].cumsum()

df_greater= df_sorted_value[df_sorted_value['Cumulative_spend']>=1000000]

results=df_greater.groupby('Card Type').first().reset_index()
results.head()

,Card Type,index,City,Date,Exp Type,Gender,Amount,Cumulative_spend
0,Gold,13431,"Delhi, India",01-Apr-14,Grocery,M,23697,1000956
1,Platinum,18394,"Surandai, India",01-Apr-14,Entertainment,F,290618,1060394
2,Signature,20659,"Jaipur, India",01-Apr-14,Bills,F,190198,1073671
3,Silver,13960,"Bengaluru, India",01-Apr-14,Entertainment,F,172789,1000757

#### Question_4

In [19]:
df_gold=df[df['Card Type']=='Gold']

gold_city=df_gold.groupby('City')['Amount'].sum().reset_index()
gold_city.head(2)

              City  Amount
0  Achalpur, India  679992
1  Adilabad, India   49020

In [20]:
total_gold= df_gold['Amount'].sum()
print(total_gold)

984539536

In [97]:
gold_city['Percentage']=(gold_city['Amount']/total_gold)*100
lowest_per=gold_city.sort_values(by='Percentage')
lowest=lowest_per.head(1)
print(lowest)

               City  Amount  Percentage
99  Dhamtari, India    1416    0.000144

#### Question_5

In [23]:
expense_per_city=df.groupby(['City', 'Exp Type'])['Amount'].sum().reset_index()

In [24]:
expense_per_city.head()

              City       Exp Type  Amount
0  Achalpur, India          Bills  624645
1  Achalpur, India  Entertainment   55347
2  Achalpur, India           Fuel  138246
3  Achalpur, India        Grocery  788403
4  Adilabad, India          Bills  868039

In [25]:
highest= expense_per_city.sort_values(['City','Amount'],ascending=False).drop_duplicates('City')
lowest= expense_per_city.sort_values(['City','Amount'],ascending=True).drop_duplicates('City')

In [26]:
highest.head(2)

                  City Exp Type  Amount
3499  Zunheboto, India  Grocery  298567
3496   Zirakpur, India     Fuel  289172

In [27]:
lowest.head(2)

              City       Exp Type  Amount
1  Achalpur, India  Entertainment   55347
6  Adilabad, India           Food   80193

In [28]:
highest= highest[['City','Exp Type']].rename(columns={'Exp Type':'highest_expense_type'})
lowest=lowest[['City','Exp Type']].rename(columns={'Exp Type':'lowest_expense_type'})

In [30]:
merge=pd.merge(highest,lowest,on='City')
print(merge)

                 City highest_expense_type lowest_expense_type
0    Zunheboto, India              Grocery       Entertainment
1     Zirakpur, India                 Fuel       Entertainment
2         Zira, India        Entertainment             Grocery
3      Zamania, India        Entertainment                Fuel
4      Zaidpur, India                 Food               Bills
..                ...                  ...                 ...
981      Adoor, India                 Fuel               Bills
982      Adoni, India                Bills       Entertainment
983  Adityapur, India                 Food             Grocery
984   Adilabad, India                Bills                Food
985   Achalpur, India              Grocery       Entertainment

[986 rows x 3 columns]

#### Question_6

In [36]:
total=df.groupby('Exp Type')['Amount'].sum()

female= df[df['Gender']== 'F'].groupby('Exp Type')['Amount'].sum()

In [37]:
percentage_female=(female/total * 100)
percentage_female.reset_index(name='Female_Percentage')

        Exp Type  Female_Percentage
0          Bills          63.945879
1  Entertainment          49.372908
2           Food          54.905311
3           Fuel          49.710381
4        Grocery          50.911023
5         Travel          51.132870

#### question_7

In [106]:
df['Y-M']=df['Date'].dt.to_period('M')

In [107]:
month= df.groupby(['Card Type', 'Exp Type', 'Y-M'])['Amount'].sum().reset_index()

In [108]:
month['Month']=month['Y-M'].dt.to_timestamp()

In [109]:
month['prev_month']=month.groupby(['Card Type','Exp Type'])['Amount'].shift(1)

In [110]:
month['growth']=(month['Amount'] - month['prev_month']) / month['prev_month'] * 100

In [111]:
growth_jan=month[month['Month'].dt.strftime('%Y-%m')=='2014-01']

In [112]:
result=growth_jan.sort_values('growth', ascending=False)

In [113]:
result_7=result.head(1)
print(result_7)

    Card Type Exp Type      Y-M   Amount      Month  prev_month     growth
103      Gold   Travel  2014-01  2092554 2014-01-01   1113534.0  87.920081

#### question_8

In [121]:
df['Day_of_week']=df['Date'].dt.dayofweek

In [122]:
weekends= df[df['Day_of_week'].isin([5,6])]

In [123]:
spend_count=weekends.groupby('City').agg(total_amount=('Amount','count'),Transaction=('Amount','count')).reset_index()

In [124]:
spend_count['Spend_Transaction_ratio']=spend_count['total_amount']/spend_count['Transaction']

In [125]:
ans=spend_count.sort_values('Spend_Transaction_ratio',ascending=False)
answer=ans.head(1)
print(ans.head(1))

              City  total_amount  Transaction  Spend_Transaction_ratio
0  Achalpur, India             2            2                      1.0

#### question_9

In [70]:
df=df.sort_values(by='Date')

In [72]:
df['Trans_Count'] = df.groupby('City').cumcount() + 1

trans_500 = df[df['Trans_Count'] == 500]

first_trans = df.groupby('City')['Date'].min().reset_index(name='First_Date')

merged = pd.merge(trans_500[['City', 'Date']], first_trans, on='City')
merged['Days_Taken'] = (merged['Date'] - merged['First_Date']).dt.days

result_9 = merged.sort_values('Days_Taken')
answer_9=result_9.head(1)
print(answer_9)

               City       Date First_Date  Days_Taken
0  Bengaluru, India 2013-12-24 2013-10-04          81

In [128]:
import pandas as pd

dfs = {
    "Q1_Percentage":answer_1,
    "Q2_highest_amount_each":card_Spend ,
    "Q3_transaction_detais":results ,
    "Q4_Lowest_Percentage": lowest,
    "Q5_query_for": merge,
    "Q6_female_percentage":percentage_female ,
    "Q7_highest_monthover_growth":result_7 ,
    "Q8_ratio":answer ,
    "Q9_least_days":answer_9,
    
}


with pd.ExcelWriter("Project2_Answer.xlsx", engine='xlsxwriter') as writer:
    for sheet_name, df in dfs.items():
        df.to_excel(writer, sheet_name=sheet_name, index=False)

print("Exported to Project2_Answer.xlsx")

Exported to Project2_Answer.xlsx